<?php
// +----------------------------------------------------------------------
// | ThinkPHP [ WE CAN DO IT JUST THINK ]
// +----------------------------------------------------------------------
// | Copyright (c) 2006~2016 http://thinkphp.cn All rights reserved.
// +----------------------------------------------------------------------
// | Licensed ( http://www.apache.org/licenses/LICENSE-2.0 )
// +----------------------------------------------------------------------
// | Author: liu21st <liu21st@gmail.com>
// +----------------------------------------------------------------------

return [
    //页面通用
    'aliyunoss_title'=>'阿里云-对象存储服务',
    'aliyunoss_description' =>'开启后请在“平台设置”里设置OSS服务器信息',
    'aliyunoss_service_title'=>'对象存储服务',
    'aliyunoss_server'=>'对象存储服务器'

];
