<?php
// +----------------------------------------------------------------------
// | ThinkPHP [ WE CAN DO IT JUST THINK ]
// +----------------------------------------------------------------------
// | Copyright (c) 2006~2016 http://thinkphp.cn All rights reserved.
// +----------------------------------------------------------------------
// | Licensed ( http://www.apache.org/licenses/LICENSE-2.0 )
// +----------------------------------------------------------------------
// | Author: liu21st <liu21st@gmail.com>
// +----------------------------------------------------------------------

return [
    //頁面通用
    'aliyunoss_title'=>'阿裏雲-對象存儲服務',
    'aliyunoss_description' =>'開啟後請在“平臺設置”裏設置OSS服務器信息',
    'aliyunoss_service_title'=>'對象存儲服務',
    'aliyunoss_server'=>'對象存儲服務器'

];
